import { ProblemInfo } from '@/types/global';

export const problemData: ProblemInfo[] = [
  {
    problemNum: 1,
    choiceAnswer: {
      problem: '다음 중 컴퓨터 정보 기기에서 사용하는 펌웨어(Firmware)에 관한 설명으로 옳은 것은?',
      example: [
        '주로 하드디스크의 부트 레코드 부분에 저장된다.',
        '인터프리터 방식으로 번역되어 실행된다.',
        '운영체제의 일부로 입출력을 전담한다.',
        '소프트웨어의 업그레이드만으로 기능을 향상시킬 수 있다.',
      ],
    },
  },
  {
    problemNum: 2,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 1번이에요.', '이건 2번이에요.', '이건 3번이에요.', '이건 4번이에요.'],
    },
  },
  {
    problemNum: 3,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 5번이에요.', '이건 6번이에요.', '이건 7번이에요.', '이건 8번이에요.'],
    },
  },
  {
    problemNum: 4,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 9번이에요.', '이건 10번이에요.', '이건 11번이에요.', '이건 12번이에요.'],
    },
  },
  {
    problemNum: 5,
    choiceAnswer: {
      problem:
        '안녕하세요. 예시문제입니다 만약에 문제가 매우길어진다면 어떻게될까요@@@@@@@@.만약에 문제가 매우길어진다면 어떻게될까요@@@@@@@@만약에 문제가 매우길어진다면 어떻게될까요@@@@@@@@만약에 문제가 매우길어진다면 어떻게될까요@@@@@@@@',
      example: [
        '이건 9번이에요. 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면??',
        '이건 10번이에요.  답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면?? 답지가 길면??',
        '이건 11번이에요.',
        '이건 12번이에요.',
      ],
    },
  },
  {
    problemNum: 6,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 7,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 8,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 9,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 10,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 11,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 12,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 13,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 14,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 15,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 16,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
  {
    problemNum: 17,
    choiceAnswer: {
      problem: '안녕하세요. 예시문제입니다.',
      example: ['이건 13번이에요.', '이건 14번이에요.', '이건 15번이에요.', '이건 16번이에요.'],
    },
  },
];
